### Pandas
- Means PanelData
- one of the data science packages
- Used for data manipulation,analysis and cleaning
- contains mainly 2 data structures in it
    - 1.Series
    - 2.DataFrames
- A series is a sequence of data
- A data frame is a data with rows and columns

In [1]:
import pandas as pd
pd.__version__

'1.0.1'

In [2]:
st='hello'
print(pd.Series(st))

0    hello
dtype: object

In [4]:
st2='hi hello hey'.split()
pd.Series(st2)

0       hi
1    hello
2      hey
dtype: object

In [7]:
li=[123,'name',9.3]
pd.Series(li,index=('num','string','float'))

num        123
string    name
float      9.3
dtype: object

In [8]:
dic={'key1':123,'key2':'hello','key3':9.3}
pd.Series(dic)

key1      123
key2    hello
key3      9.3
dtype: object

In [9]:
t=('a','b','c','d')
pd.Series(t,index=[1,2,3,4])

1    a
2    b
3    c
4    d
dtype: object

In [10]:
import numpy as np
ar=np.arange(4,10)
pd.Series(ar)

0    4
1    5
2    6
3    7
4    8
5    9
dtype: int32

In [11]:
r=np.random.randint(20,40,4)
pd.Series(r,index=['I','II','III','IV'])

I      31
II     23
III    29
IV     36
dtype: int32

### Converting strings/tuples/lists/dict into DataFrame

In [12]:
st='hey i am ruthu'.split()
pd.DataFrame(st)

       0
0    hey
1      i
2     am
3  ruthu

In [13]:
li=[[1,2,3],[4,5,6]]
pd.DataFrame(li,index=['list1','list2'])

       0  1  2
list1  1  2  3
list2  4  5  6

In [18]:
dic={'key':'hi','key2':'hey','key3':'hello'}
#print(pd.DataFrame(dic),index=[1,2])
print('........')
print(pd.DataFrame(dic,index=[1,2,3,4]))

........
  key key2   key3
1  hi  hey  hello
2  hi  hey  hello
3  hi  hey  hello
4  hi  hey  hello

In [19]:
dic2={'Names':['first name','second name','third name'],'Marks':[20,23,24],
      'ID':['N130001','N130002','N130003']}
pd.DataFrame(dic2,index=['Stu1','Stu2','Stu3'])

            Names  Marks       ID
Stu1   first name     20  N130001
Stu2  second name     23  N130002
Stu3   third name     24  N130003

In [35]:
# create the following DataFrame
Stirng  Int  Float
--      --    --
--      --    --
--      --    --

SyntaxError: invalid syntax (<ipython-input-35-9aff6f7200fe>, line 2)

In [21]:
md={'String':['hi','hey','hello'],'Integer':[12,56,78],'Folat':[9.2,8.5,7.8]}
d=pd.DataFrame(md)
d

  String  Integer  Folat
0     hi       12    9.2
1    hey       56    8.5
2  hello       78    7.8

In [22]:
dic3={'key':('a','e','i','o','u'),'key2':('b','c','d','p','k')}
pd.DataFrame(dic3)

  key key2
0   a    b
1   e    c
2   i    d
3   o    p
4   u    k

In [23]:
s=pd.Series(np.random.randint(20,40,8))
s

0    36
1    39
2    36
3    39
4    21
5    28
6    27
7    30
dtype: int32

In [24]:
print(s[3])
print(s[3:7])

39
3    39
4    21
5    28
6    27
dtype: int32

In [25]:
s.index=[np.arange(10,18)]
s

10    36
11    39
12    36
13    39
14    21
15    28
16    27
17    30
dtype: int32

### Data Analysis and Manipulation

In [26]:
import pandas as pd
df1=pd.DataFrame({"Int_rate":[2,1,2,3],
                  "Int_gdp":[50,45,45,67]},
                 index=[2041,2002,2003,2204])
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [27]:
df2=pd.DataFrame({"low_tier_hpi":[80,90,70,60],
                  "unemployment":[1,3,5,6]},
                 index=[2001,2003,2002,2005])
df2

      low_tier_hpi  unemployment
2001            80             1
2003            90             3
2002            70             5
2005            60             6

In [29]:
df1.join(df2) # which joins the both DF
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [110]:
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [111]:
df3=pd.DataFrame({"a":[80,90,60,70],
                  "b":[2,1,2,3], # 2 2 3
                  "c":[50,45,45,67]}, # 50 45 67
                 index=[2001,2002,2003,2004])
df3

       a  b   c
2001  80  2  50
2002  90  1  45
2003  60  2  45
2004  70  3  67

In [112]:
df4=pd.DataFrame({"a":[80,69,60,70],
                  "b":[2,1,2,3],
                  "c":[50,45,45,67]},
                 index=[2001,2005,2006,2008])
df4

       a  b   c
2001  80  2  50
2005  69  1  45
2006  60  2  45
2008  70  3  67

In [113]:
df3.merge(df4)

    a  b   c
0  80  2  50
1  60  2  45
2  70  3  67

In [114]:
df3.merge(df4,on='a') # based on a perticular key

    a  b_x  c_x  b_y  c_y
0  80    2   50    2   50
1  60    2   45    2   45
2  70    3   67    3   67

In [17]:
con=pd.concat([df1,df2])
con

      Int_rate  Int_gdp  low_tier_hpi  unemployment
2041       2.0     50.0           NaN           NaN
2002       1.0     45.0           NaN           NaN
2003       2.0     45.0           NaN           NaN
2204       3.0     67.0           NaN           NaN
2001       NaN      NaN          80.0           1.0
2003       NaN      NaN          90.0           3.0
2002       NaN      NaN          70.0           5.0
2005       NaN      NaN          60.0           6.0

In [19]:
df1

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [20]:
df2

      low_tier_hpi  unemployment
2001            80             1
2003            90             3
2002            70             5
2005            60             6

In [115]:
dates=pd.date_range('2020-07-25','2020-07-31')
pd.Series(dates,index=['Day1','Day2','Day3','Day4','Day5','Day6','Day7'])

Day1   2020-07-25
Day2   2020-07-26
Day3   2020-07-27
Day4   2020-07-28
Day5   2020-07-29
Day6   2020-07-30
Day7   2020-07-31
dtype: datetime64[ns]

In [116]:
dates2=pd.date_range('2019-10-20',periods=7)
dates2

DatetimeIndex(['2019-10-20', '2019-10-21', '2019-10-22', '2019-10-23',
               '2019-10-24', '2019-10-25', '2019-10-26'],
              dtype='datetime64[ns]', freq='D')

In [117]:
temp=pd.Series([32,34,30,37,40,35,40],index=dates)
temp

2020-07-25    32
2020-07-26    34
2020-07-27    30
2020-07-28    37
2020-07-29    40
2020-07-30    35
2020-07-31    40
Freq: D, dtype: int64

In [118]:
temp[3]

37

In [119]:
temp.index[2] # 3rd index value of temp series

Timestamp('2020-07-27 00:00:00', freq='D')

In [28]:
df3.columns # list of columns present in our DF

Index(['a', 'b', 'c'], dtype='object')

In [31]:
import numpy as np

In [30]:
a=np.array([['Ram',45,47,41],['Asha',29,39,40]])
a2=pd.DataFrame(a,columns=['Name','Science','Maths','English'])
a2

   Name Science Maths English
0   Ram      45    47      41
1  Asha      29    39      40

In [31]:
marks_df=pd.read_csv('marks.csv')
marks_df

  Name  Maths  Science  English
0    A   82.0     73.0     76.0
1    B   82.0     78.0     83.0
2    C   75.0     81.0     77.0
3    E   73.0     88.0     82.0
4    F   75.0     88.0     88.0
5    G   87.0     72.0     82.0
6    H   75.0     87.0      NaN
7    I    NaN     88.0     81.0
8    J   79.0      NaN     88.0
9    K   90.0     87.0     74.0

In [37]:
marks_df.head() # gives the first five rows

  Name  Maths  Science  English
0    A     75       71       85
1    B     74       77       79
2    C     82       81       86
3    E     90       88       73
4    F     88       77       86

In [38]:
marks_df.tail()

  Name  Maths  Science  English
5    G     87       85       75
6    H     90       81       71
7    I     74       70       87
8    J     70       84       82
9    K     72       84       71

In [122]:
marks_df.head(3)

  Name  Maths  Science  English
0    A   82.0     73.0     76.0
1    B   82.0     78.0     83.0
2    C   75.0     81.0     77.0

In [123]:
marks_df.tail(3)

  Name  Maths  Science  English
7    I    NaN     88.0     81.0
8    J   79.0      NaN     88.0
9    K   90.0     87.0     74.0

In [124]:
pd.read_csv('marks.csv',header=None)

       0      1        2        3
0   Name  Maths  Science  English
1      A     82       73       76
2      B     82       78       83
3      C     75       81       77
4      E     73       88       82
5      F     75       88       88
6      G     87       72       82
7      H     75       87      NaN
8      I    NaN       88       81
9      J     79      NaN       88
10     K     90       87       74

In [43]:
pd.read_csv('marks.csv',usecols=['Name','Maths'])

  Name  Maths
0    A     75
1    B     74
2    C     82
3    E     90
4    F     88
5    G     87
6    H     90
7    I     74
8    J     70
9    K     72

In [125]:
df=pd.read_csv('marks.csv',names=['N','M','S','E']) # renaming the coloumn names
df

       N      M        S        E
0   Name  Maths  Science  English
1      A     82       73       76
2      B     82       78       83
3      C     75       81       77
4      E     73       88       82
5      F     75       88       88
6      G     87       72       82
7      H     75       87      NaN
8      I    NaN       88       81
9      J     79      NaN       88
10     K     90       87       74

In [126]:
df['M']

0     Maths
1        82
2        82
3        75
4        73
5        75
6        87
7        75
8       NaN
9        79
10       90
Name: M, dtype: object

In [47]:
df[['S','M']]

          S      M
0   Science  Maths
1        71     75
2        77     74
3        81     82
4        88     90
5        77     88
6        85     87
7        81     90
8        70     74
9        84     70
10       84     72

In [110]:
marks_df

      Name  Maths  Science  English
0    'Ram'     23     45.0       35
1   'Asha'     45      NaN       66
2     Roja     49     45.0       49
3   'Ravi'     77     89.0       67
4   'Suma'    '90     56.0       39
5  'Rohan'     67     82.0       29
6  'Raman'  39.34     78.0       34
7  'Akdfj'     45     34.0       67
8   'Basha     30     58.0       91

In [50]:
df.columns

Index(['N', 'M', 'S', 'E'], dtype='object')

In [52]:
print(marks_df.info)

<bound method DataFrame.info of   Name  Maths  Science  English
0    A     75       71       85
1    B     74       77       79
2    C     82       81       86
3    E     90       88       73
4    F     88       77       86
5    G     87       85       75
6    H     90       81       71
7    I     74       70       87
8    J     70       84       82
9    K     72       84       71>

In [53]:
marks_df.describe()

           Maths    Science    English
count  10.000000  10.000000  10.000000
mean   80.200000  79.800000  79.500000
std     8.011103   5.977736   6.536224
min    70.000000  70.000000  71.000000
25%    74.000000  77.000000  73.500000
50%    78.500000  81.000000  80.500000
75%    87.750000  84.000000  85.750000
max    90.000000  88.000000  87.000000

In [114]:
marks_df.dtypes

Name        object
Maths       object
Science    float64
English      int64
dtype: object

In [117]:
marks_df.index

RangeIndex(start=0, stop=9, step=1)

In [54]:
marks_df.shape

(10, 4)

In [120]:
df.shape[0]# no.of rows

10

In [121]:
df.shape[1] # no.of columns

4

In [127]:
df.sort_values('M')

       N      M        S        E
4      E     73       88       82
3      C     75       81       77
5      F     75       88       88
7      H     75       87      NaN
9      J     79      NaN       88
1      A     82       73       76
2      B     82       78       83
6      G     87       72       82
10     K     90       87       74
0   Name  Maths  Science  English
8      I    NaN       88       81

In [124]:
marks_df.sort_values('Maths')

      Name  Maths  Science  English
4   'Suma'    '90     56.0       39
0    'Ram'     23     45.0       35
8   'Basha     30     58.0       91
6  'Raman'  39.34     78.0       34
1   'Asha'     45      NaN       66
7  'Akdfj'     45     34.0       67
2     Roja     49     45.0       49
5  'Rohan'     67     82.0       29
3   'Ravi'     77     89.0       67

In [59]:
df2=df.sort_values('E',ascending=False)
df2

       N      M        S        E
0   Name  Maths  Science  English
8      I     74       70       87
3      C     82       81       86
5      F     88       77       86
1      A     75       71       85
9      J     70       84       82
2      B     74       77       79
6      G     87       85       75
4      E     90       88       73
7      H     90       81       71
10     K     72       84       71

In [128]:
df['College']='IIIT'

In [129]:
df

       N      M        S        E College
0   Name  Maths  Science  English    IIIT
1      A     82       73       76    IIIT
2      B     82       78       83    IIIT
3      C     75       81       77    IIIT
4      E     73       88       82    IIIT
5      F     75       88       88    IIIT
6      G     87       72       82    IIIT
7      H     75       87      NaN    IIIT
8      I    NaN       88       81    IIIT
9      J     79      NaN       88    IIIT
10     K     90       87       74    IIIT

In [62]:
df['Total']=df['M']+df['S']+df['E']
df # concatenating

       N      M        S        E College                Total
0   Name  Maths  Science  English    IIIT  MathsScienceEnglish
1      A     75       71       85    IIIT               757185
2      B     74       77       79    IIIT               747779
3      C     82       81       86    IIIT               828186
4      E     90       88       73    IIIT               908873
5      F     88       77       86    IIIT               887786
6      G     87       85       75    IIIT               878575
7      H     90       81       71    IIIT               908171
8      I     74       70       87    IIIT               747087
9      J     70       84       82    IIIT               708482
10     K     72       84       71    IIIT               728471

In [138]:
df.sum()

N          Name'Ram''Asha'Roja'Ravi''Suma''Rohan''Raman''...
M                                Maths23454977'906739.344530
E                                  English356649673929346791
College             IIITIIITIIITIIITIIITIIITIIITIIITIIITIIIT
dtype: object

In [130]:
df.sample(4) # randomly seclecting the samples

       N      M        S        E College
6      G     87       72       82    IIIT
10     K     90       87       74    IIIT
0   Name  Maths  Science  English    IIIT
1      A     82       73       76    IIIT

In [69]:
df.nunique() #unique values

N          11
M           9
S           8
E           9
College     1
Total      11
dtype: int64

In [70]:
df.M.value_counts()

90       2
74       2
88       1
82       1
72       1
70       1
75       1
87       1
Maths    1
Name: M, dtype: int64

In [151]:
marks_df['Maths']

0       23
1       45
2       49
3       77
4      '90
5       67
6    39.34
7       45
8       30
Name: Maths, dtype: object

In [131]:
marks_df.isnull()

    Name  Maths  Science  English
0  False  False    False    False
1  False  False    False    False
2  False  False    False    False
3  False  False    False    False
4  False  False    False    False
5  False  False    False    False
6  False  False    False     True
7  False   True    False    False
8  False  False     True    False
9  False  False    False    False

In [132]:
marks_df.isna()

    Name  Maths  Science  English
0  False  False    False    False
1  False  False    False    False
2  False  False    False    False
3  False  False    False    False
4  False  False    False    False
5  False  False    False    False
6  False  False    False     True
7  False   True    False    False
8  False  False     True    False
9  False  False    False    False

In [133]:
marks_df.isnull().sum()

Name       0
Maths      1
Science    1
English    1
dtype: int64

In [155]:
sc=marks_df.Science
sc

0    45.0
1     NaN
2    45.0
3    89.0
4    56.0
5    82.0
6    78.0
7    34.0
8    58.0
Name: Science, dtype: float64

In [156]:
m=marks_df.Maths
m

0       23
1       45
2       49
3       77
4      '90
5       67
6    39.34
7       45
8       30
Name: Maths, dtype: object

In [79]:
marks_df.dropna() # removing None/NaN values

  Name  Maths  Science  English
0    A     75       71       85
1    B     74       77       79
2    C     82       81       86
3    E     90       88       73
4    F     88       77       86
5    G     87       85       75
6    H     90       81       71
7    I     74       70       87
8    J     70       84       82
9    K     72       84       71

In [80]:
df.dropna()

       N      M        S        E College                Total
0   Name  Maths  Science  English    IIIT  MathsScienceEnglish
1      A     75       71       85    IIIT               757185
2      B     74       77       79    IIIT               747779
3      C     82       81       86    IIIT               828186
4      E     90       88       73    IIIT               908873
5      F     88       77       86    IIIT               887786
6      G     87       85       75    IIIT               878575
7      H     90       81       71    IIIT               908171
8      I     74       70       87    IIIT               747087
9      J     70       84       82    IIIT               708482
10     K     72       84       71    IIIT               728471

In [81]:
marks_df.isnull()['Science']

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Science, dtype: bool

In [21]:
'ruthu'+'apssdc'

'ruthuapssdc'

In [22]:
'df1'+'df2'

'df1df2'

In [134]:
# 123 456 789 904 392 602
# 2+5+8+0+9+0=24
nums=input().split()
s=0
for num in nums:
    s+=int(num[1])
s

123 456 789 392 602

24